import React from "react";

export default function QuestionsSection() {
  return (
    <div className="container" id="questions">
      <div className="row row-cols-1 row-cols-md-2 g-4 m-4 text-secondary">
        <div className="col">
          <div className="pb-4 px-3 text-justify">
            <div className="h3 fw-light">
              چرا بازی های بیشتر و بهتری را ترجمه نمیکنید؟
            </div>
            <p>
              شرط اول ترجمه هر بازی فارسی پذیر بودن آن است. متاسفانه بسیاری از
              بازی های روز دنیا این امکان را ندارند. با این حال گیم ساب همیشه
              سعی داشته اغلب بازی های فارسی پذیر را که از میزان متن مناسبی نیز
              برخوردارند ترجمه کرده و در اختیار علاقه مندان قرار دهد.
            </p>
          </div>
          <div className="pb-4 px-3 text-justify">
            <div className="h3 fw-light">
              چگونه میتوانم از گیم ساب حمایت کنم؟
            </div>
            <p>
              با خرید محصولات سایت، معرفی ما به دوستان خود، دنبال کردن ما در
              شبکه های اجتماعی، لایک و ارسال مجدد پست های ما میتوانید از گیم ساب
              حمایت کنید.
            </p>
          </div>
          <div className="pb-4 px-3 text-justify">
            <div className="h3 fw-light">
              چرا پس از خرید لینک دانلود به من ایمیل نشد؟
            </div>
            <p>
              بعد از تکمیل خرید، محصول به بخش "دانلودها" موجود در پروفایل کاربری
              شما اضافه میشود و هر زمان میتوانید با ورود به حساب کاربری خود
              محصول را تنها از این بخش دانلود کنید.
            </p>
          </div>
        </div>
        <div className="col">
          <div className="pb-4 px-3 text-justify">
            <div className="h3 fw-light">چگونه از کیفیت محصول مطمئن شوم؟</div>
            <p>
              اکثر محصولات گیم ساب دارای یک فارسی ساز آزمایشی یا یک قسمت رایگان
              هستند. لذا قبل از خرید هر محصول میتوانید آن را دانلود و سپس نصب
              کرده تا از کارکرد و کیفیت محصول مطمئن شوید.
            </p>
          </div>
          <div className="pb-4 px-3 text-justify">
            <div className="h3 fw-light">
              در نصب فارسی ساز به مشکل خوردم. چگونه مشکل را حل کنم؟
            </div>
            <p>
              ابتدا مطمئن شوید که مراحل نصب را دقیقا مطابق راهنمای موجود در صفحه
              ی محصول دنبال کردید. در صورت حل نشدن مشکل در نظرات محصول مشکل خود
              را مطرح کنید تا در اسرع وقت رسیدگی شود.
            </p>
          </div>
        </div>
      </div>
    </div>
  );
}
