// eslint-disable-next-line no-unused-vars
import React from "react";

export default function ChangesTab() {
  return (
    <div>
      <h2>لیست تغییرات</h2>
      <p>نسخه های آینده:</p>
      <ul>
        <li>فارسی سازی سایر متن های باقی مانده. (تاریخ نامشخص)</li>
      </ul>
      <p>&nbsp;</p>
      <p>فارسی ساز نسخه 1.65:</p>
      <ul>
        <li>هماهنگی مجدد با آخرین نسخه اورجینال.</li>
      </ul>
      <p>&nbsp;</p>
      <p>فارسی ساز نسخه 1.64:</p>
      <ul>
        <li>فارسی سازی تمامی اخبارهای اینترنتی.</li>
      </ul>
      <p>&nbsp;</p>
      <p>فارسی ساز نسخه 1.63:</p>
      <ul>
        <li>فارسی سازی متن های شبکه اجتماعی Lifeinvader در دنیای بازی.</li>
        <li>فارسی سازی متن های شبکه اجتماعی Bleeter در دنیای بازی.</li>
        <li>فارسی سازی راهنماهای لودینگ ابتدای ورود به بازی.</li>
      </ul>
      <p>&nbsp;</p>
      <p>فارسی ساز نسخه 1.62:</p>
      <ul>
        <li>حذف 70 درصدی ایمیل های گیم ساب در محیط بازی.</li>
      </ul>
      <p>&nbsp;</p>
      <p>فارسی ساز نسخه 1.61:</p>
      <ul>
        <li>رفع ایرادات یافت شده.</li>
      </ul>
      <p>&nbsp;</p>
      <p>فارسی ساز نسخه 1.60:</p>
      <ul>
        <li>فارسی سازی زیرنویس تمامی برنامه های تلویزیونی بازی.</li>
        <li>
          فارسی سازی تمامی دیالوگ هایی که بعد از مصرف گیاه پیوت گفته میشود.
        </li>
        <li>فارسی سازی تمامی مکالمه های تلفنی خارج از ماموریت های اصلی.</li>
        <li>فارسی سازی مابقی دیالوگ های شخصیت ها حین بیرون رفتن.</li>
        <li>
          و بطور خلاصه فارسی سازی تمامی زیرنویس های باقی مانده از حالت آفلاین
          بازی.
        </li>
      </ul>
      <p>&nbsp;</p>
      <p>فارسی ساز نسخه 1.52:</p>
      <ul>
        <li>رفع ایرادات یافت شده.</li>
      </ul>
      <p>&nbsp;</p>
      <p>فارسی ساز نسخه 1.50:</p>
      <ul>
        <li>فارسی سازی تمامی ماموریت های تاکسی شخصی.</li>
        <li>فارسی سازی تمامی دیالوگ های داخل خانه شخصیت ها.</li>
        <li>فارسی سازی نیمی از مکالمه های شخصیت ها حین بیرون رفتن.</li>
        <li>فارسی سازی تمامی دیالوگ های کلاس خلبانی.</li>
        <li>فارسی سازی تمامی دیالوگ های اسلحه فروشی ها.</li>
        <li>فارسی سازی تمامی دیالوگ های لباس فروشی ها.</li>
        <li>
          فارسی سازی تمامی دیالوگ های افراد حاضر در گوشه کنار نقشه ی بازی.
        </li>
      </ul>
      <p>&nbsp;</p>
      <p>فارسی ساز نسخه 1.40:</p>
      <ul>
        <li>فارسی سازی هر سه فیلم سینمایی بازی.</li>
        <li>فارسی سازی متن پیغام گیر مخاطب ها.</li>
        <li>فارسی سازی متن اتوبوس تور در شهر.</li>
        <li>فارسی سازی یکی از ماموریت های وقایع اتفاقی جا مونده.</li>
      </ul>
      <p>&nbsp;</p>
      <p>فارسی ساز نسخه 1.31:</p>
      <ul>
        <li>
          فارسی سازی تمامی پیامک ها و ایمیل های ماموریت های وقایع اتفاقی و غریبه
          ها و عجیب الخلقه ها.
        </li>
        <li>رفع ایرادات یافت شده.</li>
      </ul>
      <p>&nbsp;</p>
      <p>فارسی ساز نسخه 1.30:</p>
      <ul>
        <li>فارسی سازی تمامی ماموریت های وقایع اتفاقی.</li>
        <li>فارسی سازی تمامی راهنمایی ها و اهداف ماموریت های وقایع اتفاقی.</li>
        <li>فارسی سازی تمامی جلسات روان پزشکی مایکل.</li>
      </ul>
      <ul>
        <li>
          فارسی سازی تمامی اهداف و راهنمایی های ماموریت های غریبه ها و عجیب
          الخلقه ها.
        </li>
        <li>رفع ایرادات یافت شده.</li>
      </ul>
      <p>&nbsp;</p>
      <p>فارسی ساز نسخه 1.20:</p>
      <ul>
        <li>فارسی سازی تمامی ماموریت های غریبه ها و عجیب الخلقه ها.</li>
        <li>
          فارسی سازی تمامی تماس های تلفنی ماموریت های غریبه ها و عجیب الخلقه ها.
        </li>
        <li>فارسی سازی تمامی ماموریت های یدک کش.</li>
      </ul>
      <p>&nbsp;</p>
      <p>فارسی ساز نسخه 1.10:</p>
      <ul>
        <li>رفع ایرادهای یافت شده.</li>
        <li>فارسی سازی دیالوگ های هنگام تعویض.</li>
      </ul>
      <p>&nbsp;</p>
      <p>فارسی ساز نسخه 1.00:</p>
      <ul>
        <li>فارسی سازی تمامی زیرنویس های ماموریت های اصلی.</li>
        <li>
          فارسی سازی تمامی تماس ها، پیامک ها، ایمیل ها، اعلام ها و راهنمایی های
          مرتبط با ماموریت های اصلی.
        </li>
        <li>فارسی سازی اکثر منوهای اصلی.</li>
        <li>فارسی سازی برخی از منوهای فعالیت های فرعی.</li>
      </ul>
    </div>
  );
}
