import React from "react";

export default function SetupGuideTab() {
  return (
    <div className="d-block">
      <h2 className="yikes-custom-woo-tab-title yikes-custom-woo-tab-title-راهنمای-نصب">
        راهنمای نصب
      </h2>
      <p>راهنمای نصب نسخه PC:</p>
      <p>
        <a href="https://www.aparat.com/v/bpDt1">آموزش تصویری</a>
      </p>
      <p>
        برنامه ی OpenIV را از{" "}
        <a href="http://ntscorp.ru/ovi/setup/ovisetup.exe">اینجا</a> دریافت کرده
        و نصب کنید. اگر برای دانلود برنامه مشکلی داشتید میتوانید نسخه قدیمی
        آفلاین برنامه را از{" "}
        <a href="https://uploadb.me/bg68kqkwydbm/OpenIVSetup_offline.rar.html">
          اینجا
        </a>{" "}
        دانلود کنید.
      </p>
      <p>
        پس از نصب برنامه را اجرا کرده و از میان بازی های موجود نسخه ی کامپیوتر
        GTA V را انتخاب کنید.
      </p>
      <p>محل بازی را برای برنامه مشخص کنید.</p>
      <p>به تب Tools بروید.</p>
      <p>
        گزینه asi manger را انتخاب کرده و تمام پیش نیاز های موجود در آن صفحه را
        نصب کنید.
      </p>
      <p>فارسی ساز را از گیم ساب دانلود کرده و در محلی دلخواه بریزید.</p>
      <p>
        دوباره به تب Tools در برنامه OpenIV بازگردید و گزینه ی Package Installer
        را انتخاب کنید.
      </p>
      <p>
        از محل نصب فارسی ساز فایل GTA V Complete FarsiSaz GameSub را انتخاب
        کنید.
      </p>
      <p>به روی گزینه ی Install کلیک کنید.</p>
      <p>سپس گزینهmods folder را انتخاب کنید و منتظر بمانید نصب تکمیل شود.</p>
      <p>
        در صورت استفاده از نسخه اورجینال قبل از اجرای بازی حتما مطمئن بشید که
        استیم آفلاین یا اینترنت قطع است.
      </p>
      <p>داخل بازی رفته و زیرنویس را فعال کنید.</p>
      <p>از بازی لذت ببرید.</p>
      <p></p>
      <p>نسخه ی هماهنگ PC:</p>
      <p>این فارسی ساز با تمامی نسخه های بازی هماهنگ است.</p>
      <p></p>
      <p>راهنمای تغییر سایز زیرنویس نسخه PC:</p>
      <p>
        برای تغییر سایز زیرنویس به پوشهSize در محل نصب زیرنویس رفته و یکی از
        فایل های موجود را براساس سلیقه مطابق راهنمای بالا نصب کنید.
      </p>
      <p></p>
      <p>راهنمای تغییر رنگ زیرنویس نسخه PC:</p>
      <p>در صورت علاقه میتوانید رنگ زیرنویس را به زرد تغییر دهید.</p>
      <p>
        برای این منظور به پوشهColor در محل نصب زیرنویس رفته و فایل GTA V
        Complete GameSub – Yellow.oiv را مطابق راهنمای بالا نصب کنید.
      </p>
      <p></p>
      <p>راهنمای پاک کردن فارسی ساز در نسخهPC:</p>
      <p>
        در صورتی که مطابق آموزش در حین نصب فارسی ساز گزینه mods folder را زده
        باشید، تنها کافیست که فولدر mods را به همراه فایل های openCameraV.asi –
        dinput8.dll – OpenIV.asi از محل نصب بازی حذف کنید.
      </p>
      <p>
        همچنین در صورت استفاده از نسخه اورجینال استیم، برای اطمینان بیشتر پس از
        پاک کردن فولدر mods با کلیک روی گزینه Verify Integrity of Game Files از
        پاک شدن کامل فارسی ساز اطمینان حاصل کنید.
      </p>
      <p></p>
      <hr />
      <p></p>
      <p>پیش نیازهای نصب فارسی ساز پلی استیشن ۴:</p>
      <p>
        قبل از نصب فارسی ساز لازم است که کنسول شما کپی خور باشد و هک 9.00 یا
        جدیدتر روی آن اعمال شده باشد.
      </p>
      <p>
        در غیر این صورت نصب فارسی ساز روی دستگاه ممکن نیست و در صورتی که ورژن
        پایین تری از هک روی دستگاه شما باشد، برای نصب و اجرای صحیح فارسی ساز
        تضمینی وجود ندارد.
      </p>
      <p>
        برای استفاده از این فارسی ساز حداقل به گلدن هن ورژن 2.3 نیاز دارید. اگر
        هاستی که برای اعمال هک استفاده میکنید قدیمی است بهتر است از{" "}
        <a href="https://karo218.ir/900/index.html">این هاست</a> استفاده کنید.
      </p>
      <p>
        همچنین برای استفاده از فارسی ساز نیاز است که آپدیت 1.46 بازی نیز نصب شده
        باشد.
      </p>
      <p>
        اگر هنوز این بازی را دانلود نکردید و قصد دانلود بازی را دارید، میتوانید
        از لینک زیر برای دانلود بازی و آپدیت آن استفاده کنید.
      </p>
      <p>
        <a
          href="https://drive.google.com/drive/folders/1LOjgVhGEftKIk6ZQUuZpEIxqeQf-h6Zq"
          target="_blank"
          rel="noopener"
        >
          لینک دانلود بازی به همراه آپدیت
        </a>
      </p>
      <p>رمز فایل های دانلود شده از لینک بالا www.gamesub.in است.</p>
      <p>راهنمای نصب فارسی ساز پلی استیشن ۴:</p>
      <p>قبل از شروع از نصب بودن بازی و آپدیت 1.46 روی کنسول مطمئن شوید.</p>
      <p>
        به انتخاب خود یکی از فارسی سازهای موجود را دانلود کرده و به روی یک فلش
        بریزید.
      </p>
      <p>
        فلش را به PS4 متصل کنید و به مسیر Settings &gt; GoldenHEN &gt;Debug
        Settings &gt; Game &gt; Package Installer بروید.
      </p>
      <p>فایل فارسی ساز را انتخاب کرده و نصب کنید.</p>
      <p>
        به مسیر Settings &gt; GoldenHEN &gt; Plugin Settings رفته و تیک گزینه
        Enable Plugins Loader را بزنید.
      </p>
      <p>از منوی اصلی کنسول برنامه فارسی ساز را اجرا کنید.</p>
      <p>
        منتظر بمانید تا کپی فایل ها به پایان برسد و دستگاه به صورت خودکار خاموش
        شود.
      </p>
      <p>
        بازی را اجرا کرده و چند ثانیه منتظر بمانید تا پیغام [GTAV] – ProjectV در
        بالا سمت چپ صفحه نمایش داده شود. نمایش این پیغام به معنی موفقیت آمیز
        بودن نصب فارسی ساز است.
      </p>
      <p>از تنظیمات بازی قسمت “نمایش” زیرنویس را روشن کنید.</p>
      <p>از بازی لذت ببرید.</p>
      <p>
        <span className="text-danger">
          توجه 1: برای فارسی سازی بازی تنها نیاز است یکبار مراحل بالا را اجرا
          کنید و در دفعات بعدی نیازی به تکرار این مراحل نیست.
        </span>
      </p>
      <p>
        <span className="text-danger">
          توجه 2: پس از پایان مراحل بالا میتوانید برنامه فارسی ساز را از روی
          کنسول حذف کنید.
        </span>
      </p>
      <p></p>
      <p>آموزش رفع مشکلات فارسی ساز پلی استیشن 4:</p>
      <p>
        قبل از همه به پیش نیازهای فارسی ساز یعنی نصب بودن آپدیت 1.46، استفاده از
        هک 9.00 و استفاده از یک هاست به روز شده ای که حداقل گلدن هن ورژن 2.3 را
        دارا میباشد توجه کنید. چرا که نادیده گرفتن هر یک از این موارد میتواند
        باعث خطا در مراحل نصب فارسی ساز شود.
      </p>
      <p>
        در صورتی که موارد بالا را رعایت میکنید و بعد از نصب فارسی ساز همچنان
        تغییری روی بازی مشاهده نمیکنید، نصب فارسی ساز به صورت کاملا خودکار روی
        دستگاه شما انجام نشده است.
      </p>
      <p>
        برای حل این مشکل لازم است که بخشی از فایل های فارسی ساز را به کمک ftp به
        صورت دستی به دستگاه خود انتقال دهید.
      </p>
      <p>
        برای استفاده از ftp به یک تلفن همراه اندرویدی و یک اپ فایل منیجر که از
        ftp پشتیبانی میکند نیاز دارید.
      </p>
      <p>
        همچنین لازم است که گوشی و پلی استیشن 4 شما به یک اینترنت مشترک متصل
        باشند. برای این منظور میتوانید از وای فای مودم یا هات اسپات تلفن همراه
        خود استفاده کنید.
      </p>
      <p>
        برای ساده تر شدن این آموزش ما از اپ اندرویدی RS File Manager استفاده
        کردیم. این اپ را میتوانید از لینک های زیر دانلود کنید:
        <br />
        <a href="https://play.google.com/store/apps/details?id=com.rs.explorer.filemanager&amp;hl=en&amp;gl=US">
          دانلود از گوگل پلی
        </a>{" "}
        –{" "}
        <a href="https://www.farsroid.com/rs-file-manager/">
          دانلود از فارسروید
        </a>{" "}
        –{" "}
        <a href="https://uploadb.me/nd6nsivf9xnt/RS-File-Manager-Pro-2.0.3.apk.html">
          دانلود از گیم ساب
        </a>
      </p>
      <p></p>
      <p>
        ابتدا گوشی و پلی استیشن 4 را به یک اینترنت مشترک متصل کرده و فیلتر شکن
        خود را خاموش کنید.
      </p>
      <p>
        اپ RS File Manager را باز کرده و در صفحه اصلی آن گزینه ftp را پیدا و
        انتخاب کنید.
      </p>
      <p>در صفحه باز شده به ترتیب گزینه مثبت، جدید و ftp را بزنید.</p>
      <p>
        به مسیر Settings &gt; GoldenHEN &gt; Servers Settings در پلی استیشن 4
        رفته و تیک گزینه Enable FTP Server را بزنید. اعداد نمایش داده شده در
        بالا سمت چپ صفحه را در کادر سرور و درگاه اپ RS File Manager وارد کنید.
      </p>
      <p>
        یک نام کاربری دلخواه وارد کرده و بدون تغییر دادن سایر موارد گزینه “خوب”
        را انتخاب کنید.
      </p>
      <p>
        اگر تمام موارد بالا را به درستی انجام داده باشید، حالا از طریق اپ RS
        File Manager میتوانید به پوشه های پلی استیشن 4 خود دسترسی داشته باشید و
        تغییرات لازم را اعمال کنید.
      </p>
      <p></p>
      <p>
        ابتدا به پوشه data بروید و اگر پوشه gta5 در آن محل وجود داشت آن را حذف
        کنید.
      </p>
      <p>
        حالا لازم است که فایل های{" "}
        <a href="https://uploadb.me/jcd1u05cew5l/plugins.ini.html">
          plugins.ini
        </a>{" "}
        و{" "}
        <a href="https://uploadb.me/oa4kwj3c4j45/ProjectV.prx.html">
          ProjectV.prx
        </a>{" "}
        را دانلود کرده و روی کنسول خود در محل مناسب قرار دهید.
      </p>
      <p>
        به مسیر data/GoldHEN بروید. اگر فایل plugins.ini از قبل در آن محل وجود
        داشت آن را حذف کنید و بعد فایل جدیدی که دانلود کردید را در آنجا قرار
        دهید. سپس به مسیر data/GoldHEN/plugins بروید و همین کار را برای فایل
        ProjectV.prx تکرار کنید.
      </p>
      <p>
        در نهایت پس از قطع اینترنت مراحل نصب فارسی ساز را دوباره از ابتدا شروع
        کنید.
      </p>
      <p></p>
      <p>
        <span className="text-danger">
          توجه 1: در مدتی که از طریق اپ RS File Manager به پوشه های پلی استیشن 4
          دسترسی دارید تنها موارد خواسته شده را انجام دهید و تغییری روی هیچ یک
          از فایل ها و پوشه های دیگر دستگاه اعمال نکنید.
        </span>
      </p>
      <p>
        <span className="text-danger">
          توجه 2: به محض پایان یافتن مراحل بالا اینترنت را قطع کنید چرا که دیگر
          نیازی به متصل ماندن پلی استیشن 4 به اینترنت وجود ندارد.
        </span>
      </p>
      <p>
        <span className="text-danger">
          توجه 3: در مدتی که پلی استیشن 4 به اینترنت متصل است مراقب باشید تا
          دستگاه آپدیت نشود. توصیه میشود در طول این مدت هیچ برنامه یا بازی ای را
          روی کنسول اجرا نکنید.
        </span>
      </p>
      <p>
        <span className="text-danger">
          توجه 4: در صورت استفاده از هات اسپات توصیه میشود که سقف مقدار مصرف را
          به حداقل مقدار کاهش دهید تا اگر دانلود فایلی توسط کنسول آغاز شد، در
          مدت کوتاهی با قطع شدن اینترنت متوقف شود.
        </span>
      </p>
      <p>
        <span className="text-danger">
          توجه 5: سایت گیم ساب هیچگونه مسئولیتی در قبال خطاهایی که ممکن است توسط
          کاربر در حین انجام این مراحل رخ دهد به عهده ندارد. لطفا تنها در صورتی
          این مراحل را انجام دهید که یک آشنایی ابتدایی با چنین مواردی داشته
          باشید.
        </span>
      </p>
      <p>
        در صورتی که در رابطه با مراحل بالا سوالی داشتید میتوانید به{" "}
        <a href="https://t.me/GameSub_Support">پشتیبانی گیم ساب</a> پیام دهید.
      </p>
      <hr />
      <p>راهنمای نصب نسخه PS3:</p>
      <p>
        <a href="https://www.aparat.com/v/54TIE">آموزش تصویری</a>
      </p>
      <p>
        قبل از هر اقدامی از بازی خود یک کپی تهیه کنید تا در صورت هر گونه مشکل
        بازی اصلی آسیبی نبیند.
      </p>
      <p>
        فارسی ساز را دانلود کرده و فایلencryption_key.bin را در محلی که
        پوشهPS3_GAME قرار دارد بریزید.
      </p>
      <p>
        برنامه ی OpenIV را از{" "}
        <a href="http://ntscorp.ru/ovi/setup/ovisetup.exe">اینجا</a> دریافت کرده
        و نصب کنید.
      </p>
      <p>
        پس از نصب برنامه را اجرا کرده و از میان بازی های موجود نسخه ی پلی استیشن
        GTA V را انتخاب کنید.
      </p>
      <p>محل بازی را برای برنامه مشخص کنید.</p>
      <p>از تب file گزینه Edit mode را انتخاب کنید.</p>
      <p>
        با کمک برنامهOpenIV فایل های موجود در پوشه GTA V Farsisaz PS3 را جایگزین
        فایل های موجود در بازی کنید.
      </p>
      <p>برنامه را ببندید و بازی را به روی دستگاه اجرا کنید.</p>
      <p>از تنظیمات بازی گزینه زیرنویس را فعال کنید.</p>
      <p>از بازی لذت ببرید.</p>

      <p>نسخه ی هماهنگ PS3:</p>
      <p>این فارسی ساز با تمامی نسخه های بازی هماهنگ است.</p>

      <p>راهنمای تغییر سایز زیرنویس نسخه PS3:</p>
      <p>
        برای تغییر سایز زیرنویس به پوشه Size از فارسی ساز رفته و یکی از فایل های
        موجود را براساس سلیقه مطابق راهنمای بالا جایگزین کنید.
      </p>

      <p>راهنمای تغییر رنگ زیرنویس نسخه PS3:</p>
      <p>در صورت علاقه میتوانید رنگ زیرنویس را به زرد تغییر دهید.</p>
      <p>
        برای این منظور به پوشهColor از فارسی ساز رفته و فایلموجود را مطابق
        راهنمای بالا جایگزین کنید.
      </p>
    </div>
  );
}
